1sZayavki/InformationRegisters/Задачи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<InformationRegister>
		<Properties>
			<Name>Задачи</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Минут</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Часов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ДеньРаботы</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>План</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Передано</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Задача</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Задачи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОтделЗаказчик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОтделЗаказчик</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Заказчик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Заказчики</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыЗадач</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Исполнитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Начало</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Окончание</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

1sZayavki/CommonModules/Задачи_м/Ext/Module.bsl
Процедура ДобавитьВремяКЗадаче(Исполнитель, ДеньРаботы, План, Передано, Задача, ОтделЗаказчик, Заказчик, Статус, Минут, Часов, ДобавитьМинут, Начало, Окончание, НовоеОкончание) Экспорт

	МенеджерЗаписи = РегистрыСведений.Задачи.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Исполнитель = Исполнитель;
	МенеджерЗаписи.ДеньРаботы = ДеньРаботы;
	МенеджерЗаписи.План = План;
	МенеджерЗаписи.Передано = Передано;
	МенеджерЗаписи.Задача = Задача;
	МенеджерЗаписи.ОтделЗаказчик = ОтделЗаказчик;
	МенеджерЗаписи.Заказчик = Заказчик;
	МенеджерЗаписи.Начало = Начало;
	МенеджерЗаписи.Окончание = Окончание;
	МенеджерЗаписи.Статус = Статус;
	МенеджерЗаписи.Минут = Минут;
	МенеджерЗаписи.Часов = Часов;
	
	МенеджерЗаписи.Прочитать();
	Если МенеджерЗаписи.Выбран() Тогда
		
		//существует - перезаписываем
		МенеджерЗаписи.Исполнитель = Исполнитель;
		МенеджерЗаписи.ДеньРаботы = ДеньРаботы;
		МенеджерЗаписи.План = План;
		МенеджерЗаписи.Передано = Передано;
		МенеджерЗаписи.Задача = Задача;
		МенеджерЗаписи.ОтделЗаказчик = ОтделЗаказчик;
		МенеджерЗаписи.Заказчик = Заказчик;
		МенеджерЗаписи.Начало = Начало;
		МенеджерЗаписи.Окончание = НовоеОкончание;
		МенеджерЗаписи.Статус = Статус;
		МенеджерЗаписи.Минут = Минут;
		МенеджерЗаписи.Часов = Часов;
		
		МенеджерЗаписи.Минут = МенеджерЗаписи.Минут + ДобавитьМинут;
		МенеджерЗаписи.Часов = МенеджерЗаписи.Минут / 60;
		
		МенеджерЗаписи.Записать(Истина);
		
	Иначе 
		
		//
		
	КонецЕсли;
	
КонецПроцедуры
